{
  "backend/main.mo": "Main Motoko actor implementing fitness tracking backend with user profiles, exercise library, workout logging, workout plans, and progress statistics. Includes role-based access control using MixinAuthorization and AccessControl modules.",
  "feature_evidence.json": "Feature evidence report documenting two completed features: removing broken features causing deployment failures and verifying Internet Identity authentication with protected routes.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing authentication, routing, workout tracking components, exercise library, and styling with energetic orange/red/yellow theme.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark mode color variables for an energetic fitness theme with vibrant orange, red, and yellow palette.",
  "frontend/index.html": "HTML entry point with page title 'Amit Sharma Fitness' and root div for React application mounting.",
  "frontend/src/App.tsx": "TanStack Router setup with root layout and four authenticated routes (dashboard, log workout, history, exercises) all wrapped with AuthGuard component.",
  "frontend/src/components/AuthGuard.tsx": "Authentication guard component that shows welcome screen with login prompt for unauthenticated users, or renders children for authenticated users, with loading states.",
  "frontend/src/components/ExerciseLibrary.tsx": "Exercise library browser with search, muscle group filtering (including Home Workout category), default exercise list with 30+ exercises, and form to add custom exercises with category selection.",
  "frontend/src/components/Layout.tsx": "Main layout component with header navigation, authentication controls (login/logout), and mobile/desktop responsive navigation links for Dashboard, Log Workout, History, and Exercises pages.",
  "frontend/src/components/ProgressDashboard.tsx": "Displays user progress statistics in three gradient cards showing total workouts, workout plans, and total volume lifted with loading skeleton states.",
  "frontend/src/components/WorkoutHistoryList.tsx": "Renders a list of past workouts sorted by timestamp, showing date, time, volume per workout, and exercise details with sets/reps, or an empty state prompting users to log their first workout.",
  "frontend/src/components/WorkoutLogger.tsx": "Form component for logging workouts with dynamic exercise and set management, exercise library integration for auto-filling muscle groups/categories, and submission handling with validation and navigation.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state, handling both authenticated and anonymous actors with automatic query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for managing user login/logout state, identity persistence, and AuthClient configuration with support for delegation identity validation.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching workout history, exercise library, progress stats, and workout plans, plus mutations for logging workouts, adding exercises, and creating workout plans. All queries check for authentication before executing.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom color palette using OKLCH color space, featuring energetic orange/red/yellow theme for both light and dark modes with high contrast and vibrant accent colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the main App component.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page with hero section featuring background image, call-to-action buttons for logging workouts and viewing history, progress dashboard component, and quick action cards for starting workouts, browsing exercises, and viewing history.",
  "frontend/src/pages/ExerciseLibrary.tsx": "Exercise library page wrapper that displays the ExerciseLibrary component with a header showing a library icon and title.",
  "frontend/src/pages/History.tsx": "Workout history page wrapper that displays the WorkoutHistoryList component with a header showing a history icon and title.",
  "frontend/src/pages/LogWorkout.tsx": "Log workout page wrapper that displays the WorkoutLogger component with a header showing a dumbbell icon and title.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and functions to clear parameters from URL and storage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending default theme with custom OKLCH color system, container settings, border radius variables, Inter font family, enhanced shadows, and accordion animations using tailwindcss-animate plugin.",
  "project_state.json": "Project state tracking document for a Hevy-inspired fitness app with workout tracking, BMI calculator, meal tracking, training phases, and Instagram-style content gallery. Notes previous build failures and lists pending feature requests."
}