{
  "backend/main.mo": "Main actor defining Exercise, Set, Workout, WorkoutPlan types and functions to add exercises, log workouts, create workout plans, and query workout history, exercise library, and progress stats with volume tracking.",
  "backend/migration.mo": "Migration module that transforms old actor state (without category field) to new actor state by adding a default 'Gym' category to all exercises and workout entries, and initializing an empty plans list.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features: rest timer, workout plan management, accessible UI design for ages 10-60, and home workout category with bodyweight exercises.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of 14 frontend files including App, hooks, components, and pages describing routing, queries, workout logging, history, exercise library with home workouts, and styling.",
  "frontend/index.css": "Tailwind CSS base styles defining CSS custom properties for light and dark themes using OKLCH color space with neutral grayscale palette and chart colors.",
  "frontend/index.html": "HTML entry point with viewport meta tag, 'Fitness Tracker' title, root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "TanStack Router setup defining root route with Layout and four child routes: dashboard (/), log workout, history, and exercises pages.",
  "frontend/src/components/ExerciseLibrary.tsx": "Exercise library component with search, muscle group filtering (including Home Workout), default exercises list with 30+ exercises across 7 categories, and form to add custom exercises with category selection.",
  "frontend/src/components/Layout.tsx": "Root layout with gradient header featuring FitTrack branding, responsive navigation for Dashboard/Log Workout/History/Exercises routes, and footer with caffeine.ai attribution link.",
  "frontend/src/components/ProgressDashboard.tsx": "Displays a dashboard with three stat cards showing total workouts, workout plans, and total volume lifted, using gradient backgrounds and icons. Fetches progress stats via useGetProgressStats hook and shows loading skeletons while data loads.",
  "frontend/src/components/WorkoutHistoryList.tsx": "Renders a list of past workouts sorted by timestamp, displaying date, time, exercises, sets, reps, and volume for each workout. Shows empty state with call-to-action when no workouts exist and displays total volume lifted in a summary card.",
  "frontend/src/components/WorkoutLogger.tsx": "Provides a form interface for logging workouts with dynamic exercise and set management, including exercise selection from library, rep/weight inputs, and add/remove controls. Submits workout entries via useLogWorkout mutation and navigates to history on success.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on Internet Identity authentication state, returning anonymous or authenticated actors. Invalidates and refetches dependent queries when the actor changes due to identity updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login/logout flow and identity state. Creates AuthClient with configurable options and handles identity persistence across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching workout history, exercise library, progress stats, and workout plans, plus mutations for logging workouts, adding exercises, and creating workout plans. All hooks depend on the authenticated actor and invalidate related queries on mutation success.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom color palette using CSS variables for light and dark modes, featuring energetic orange/red/yellow theme colors. Sets up base styles for body and universal border styling.",
  "frontend/src/main.tsx": "Application entry point that renders the root component with QueryClientProvider and InternetIdentityProvider wrappers. Initializes React Query client and mounts the App component to the DOM.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page with hero section, progress dashboard component, and quick action cards linking to workout logging, exercise library, and history views.",
  "frontend/src/pages/ExerciseLibrary.tsx": "Page wrapper for the ExerciseLibrary component with header displaying library icon and title.",
  "frontend/src/pages/History.tsx": "Page wrapper for the WorkoutHistoryList component with header displaying history icon and title.",
  "frontend/src/pages/LogWorkout.tsx": "Page wrapper for the WorkoutLogger component with header displaying dumbbell icon and title.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH, extended border radius, typography, animations, and plugins for typography, container queries, and animate.",
  "project_state.json": "Project state tracking document listing implemented features including workout logging, history, exercise library, progress tracking, rest timer, workout plans, and UI theming with accessibility considerations."
}