{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Simplify and stabilize fitness app build",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Remove incomplete or broken features causing deployment failures",
      "acceptanceCriteria": [
        "App deploys successfully without errors",
        "All existing working features (workout logging, exercise library, authentication) remain functional"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Review and remove any broken route configurations or incomplete feature imports that may cause deployment failures. Verify all four existing routes (dashboard, log workout, history, exercises) are properly configured and wrapped in AuthGuard."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Review all React Query hooks to ensure they properly check for authentication before executing. Remove any incomplete query or mutation hooks that reference non-existent backend methods. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Verify navigation links are correctly wired and all imports resolve properly. Ensure the authorization component's authentication hooks are used correctly for login/logout functionality."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure workout logger, exercise library, and workout history features work correctly for authenticated users",
      "acceptanceCriteria": [
        "Users can log workouts with exercises, sets, reps, and weight",
        "Exercise library displays all exercises with search and filtering",
        "Workout history shows all logged workouts with correct data",
        "Dashboard displays accurate workout statistics"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/WorkoutLogger.tsx",
          "operation": "modify",
          "description": "Verify the workout logging form correctly converts form data to WorkoutEntry format and successfully calls the logWorkout mutation. Ensure exercise selection from library works properly and all sets/reps/weight inputs are validated before submission."
        },
        {
          "path": "frontend/src/components/ExerciseLibrary.tsx",
          "operation": "modify",
          "description": "Verify search functionality, muscle group filtering, and custom exercise addition work correctly. Ensure the component properly fetches and displays the exercise library from the backend using the useGetExerciseLibrary hook."
        },
        {
          "path": "frontend/src/components/WorkoutHistoryList.tsx",
          "operation": "modify",
          "description": "Verify workout history displays correctly with proper date formatting, volume calculations, and exercise details. Ensure the component uses the useGetWorkoutHistory hook properly and handles empty states."
        },
        {
          "path": "frontend/src/components/ProgressDashboard.tsx",
          "operation": "modify",
          "description": "Verify the dashboard fetches and displays accurate statistics using the useGetProgressStats hook. Ensure all three stat cards (Total Workouts, Workout Plans, Total Volume) show correct data with proper formatting."
        },
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Verify the dashboard page properly integrates the ProgressDashboard component and displays hero section with background image at frontend/public/assets/generated/hero-fitness.dim_1920x1080.png. Ensure call-to-action buttons correctly navigate to log workout and history pages."
        },
        {
          "path": "frontend/src/pages/LogWorkout.tsx",
          "operation": "modify",
          "description": "Verify the WorkoutLogger component is properly integrated and all functionality works end-to-end for logging workouts."
        },
        {
          "path": "frontend/src/pages/History.tsx",
          "operation": "modify",
          "description": "Verify the WorkoutHistoryList component is properly integrated and displays workout history correctly."
        },
        {
          "path": "frontend/src/pages/ExerciseLibrary.tsx",
          "operation": "modify",
          "description": "Verify the ExerciseLibrary component is properly integrated and all library functionality works correctly."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Verify Internet Identity authentication works properly and all protected routes require login",
      "acceptanceCriteria": [
        "Login button successfully authenticates users via Internet Identity",
        "All workout features are only accessible after authentication",
        "Logout functionality works correctly"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AuthGuard.tsx",
          "operation": "modify",
          "description": "Verify the AuthGuard component properly uses the authorization component's authentication hooks (useInternetIdentity) to check authentication status. Ensure it shows the welcome screen with login button for unauthenticated users and properly renders children for authenticated users with correct loading states."
        },
        {
          "path": "frontend/src/hooks/useInternetIdentity.ts",
          "operation": "modify",
          "description": "Verify the Internet Identity hook properly manages AuthClient creation, login/logout flows, identity state, and login status. Ensure the authorization component's authentication system is correctly integrated. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Verify login and logout buttons work correctly using the useInternetIdentity hook from the authorization component. Ensure authentication state is properly reflected in the UI and queryClient.clear() is called on logout to clear all cached data."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Verify all routes are properly wrapped with AuthGuard to ensure authentication is required before accessing any workout features. Confirm the authorization component's authentication requirements are enforced across all routes."
        },
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Verify the actor hook properly creates and manages the backend actor instance based on Internet Identity authentication state. Ensure it invalidates dependent queries when the actor changes and properly integrates with the authorization component."
        }
      ]
    }
  ]
}